#include "CNGLBrick.h"

//---------------------------------------------------------------------------- 
// Nome: CNGLBrick(void)
// Desc: construtor padrão
// Pams: nenhum
//---------------------------------------------------------------------------- 
CNGLBrick::CNGLBrick() 
{
	iImage = 0;
	iFrame = 0;
}

//---------------------------------------------------------------------------- 
// Nome: ~CNGLBrick(void)
// Desc: destrutor padrão
// Pams: nenhum
//---------------------------------------------------------------------------- 
CNGLBrick::~CNGLBrick() 
{
}

//---------------------------------------------------------------------------- 
// Nome: Release(void)
// Desc: finaliza o brick 
// Pams: nenhum
//----------------------------------------------------------------------------
bool CNGLBrick::Release()
{
	return true;
}